----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 112, 112]           9,408
       BatchNorm2d-2         [-1, 64, 112, 112]             128
              ReLU-3         [-1, 64, 112, 112]               0
         MaxPool2d-4           [-1, 64, 56, 56]               0
            Conv2d-5           [-1, 64, 56, 56]          36,864
       BatchNorm2d-6           [-1, 64, 56, 56]             128
              ReLU-7           [-1, 64, 56, 56]               0
            Conv2d-8           [-1, 64, 56, 56]          36,864
       BatchNorm2d-9           [-1, 64, 56, 56]             128
             ReLU-10           [-1, 64, 56, 56]               0
       BasicBlock-11           [-1, 64, 56, 56]               0
           Conv2d-12           [-1, 64, 56, 56]          36,864
      BatchNorm2d-13           [-1, 64, 56, 56]             128
             ReLU-14           [-1, 64, 56, 56]               0
           Conv2d-15           [-1, 64, 56, 56]          36,864
      BatchNorm2d-16           [-1, 64, 56, 56]             128
             ReLU-17           [-1, 64, 56, 56]               0
       BasicBlock-18           [-1, 64, 56, 56]               0
           Conv2d-19           [-1, 64, 56, 56]          36,864
      BatchNorm2d-20           [-1, 64, 56, 56]             128
             ReLU-21           [-1, 64, 56, 56]               0
           Conv2d-22           [-1, 64, 56, 56]          36,864
      BatchNorm2d-23           [-1, 64, 56, 56]             128
             ReLU-24           [-1, 64, 56, 56]               0
       BasicBlock-25           [-1, 64, 56, 56]               0
           Conv2d-26          [-1, 128, 56, 56]          73,728
      BatchNorm2d-27          [-1, 128, 56, 56]             256
             ReLU-28          [-1, 128, 56, 56]               0
           Conv2d-29          [-1, 128, 56, 56]         147,456
      BatchNorm2d-30          [-1, 128, 56, 56]             256
           Conv2d-31          [-1, 128, 56, 56]           8,192
           Conv2d-32          [-1, 128, 56, 56]           8,192
      BatchNorm2d-33          [-1, 128, 56, 56]             256
      BatchNorm2d-34          [-1, 128, 56, 56]             256
             ReLU-35          [-1, 128, 56, 56]               0
       BasicBlock-36          [-1, 128, 56, 56]               0
        MaxPool2d-37          [-1, 128, 28, 28]               0
           Conv2d-38          [-1, 256, 28, 28]         294,912
      BatchNorm2d-39          [-1, 256, 28, 28]             512
             ReLU-40          [-1, 256, 28, 28]               0
           Conv2d-41          [-1, 256, 28, 28]         589,824
      BatchNorm2d-42          [-1, 256, 28, 28]             512
           Conv2d-43          [-1, 256, 28, 28]          32,768
           Conv2d-44          [-1, 256, 28, 28]          32,768
      BatchNorm2d-45          [-1, 256, 28, 28]             512
      BatchNorm2d-46          [-1, 256, 28, 28]             512
             ReLU-47          [-1, 256, 28, 28]               0
       BasicBlock-48          [-1, 256, 28, 28]               0
        MaxPool2d-49          [-1, 256, 14, 14]               0
           Conv2d-50          [-1, 512, 14, 14]       1,179,648
      BatchNorm2d-51          [-1, 512, 14, 14]           1,024
             ReLU-52          [-1, 512, 14, 14]               0
           Conv2d-53          [-1, 512, 14, 14]       2,359,296
      BatchNorm2d-54          [-1, 512, 14, 14]           1,024
           Conv2d-55          [-1, 512, 14, 14]         131,072
           Conv2d-56          [-1, 512, 14, 14]         131,072
      BatchNorm2d-57          [-1, 512, 14, 14]           1,024
      BatchNorm2d-58          [-1, 512, 14, 14]           1,024
             ReLU-59          [-1, 512, 14, 14]               0
       BasicBlock-60          [-1, 512, 14, 14]               0
        MaxPool2d-61            [-1, 512, 7, 7]               0
           Conv2d-62           [-1, 1024, 7, 7]       4,718,592
      BatchNorm2d-63           [-1, 1024, 7, 7]           2,048
             ReLU-64           [-1, 1024, 7, 7]               0
           Conv2d-65           [-1, 1024, 7, 7]       9,437,184
      BatchNorm2d-66           [-1, 1024, 7, 7]           2,048
           Conv2d-67           [-1, 1024, 7, 7]         524,288
           Conv2d-68           [-1, 1024, 7, 7]         524,288
      BatchNorm2d-69           [-1, 1024, 7, 7]           2,048
      BatchNorm2d-70           [-1, 1024, 7, 7]           2,048
             ReLU-71           [-1, 1024, 7, 7]               0
       BasicBlock-72           [-1, 1024, 7, 7]               0
  ConvTranspose2d-73          [-1, 512, 14, 14]       2,097,664
      BatchNorm2d-74          [-1, 512, 14, 14]           1,024
             ReLU-75          [-1, 512, 14, 14]               0
           Conv2d-76          [-1, 512, 14, 14]       4,718,592
      BatchNorm2d-77          [-1, 512, 14, 14]           1,024
             ReLU-78          [-1, 512, 14, 14]               0
           Conv2d-79          [-1, 512, 14, 14]       2,359,296
      BatchNorm2d-80          [-1, 512, 14, 14]           1,024
           Conv2d-81          [-1, 512, 14, 14]         524,288
           Conv2d-82          [-1, 512, 14, 14]         524,288
      BatchNorm2d-83          [-1, 512, 14, 14]           1,024
      BatchNorm2d-84          [-1, 512, 14, 14]           1,024
             ReLU-85          [-1, 512, 14, 14]               0
       BasicBlock-86          [-1, 512, 14, 14]               0
  ConvTranspose2d-87          [-1, 256, 28, 28]         524,544
      BatchNorm2d-88          [-1, 256, 28, 28]             512
             ReLU-89          [-1, 256, 28, 28]               0
           Conv2d-90          [-1, 256, 28, 28]       1,179,648
      BatchNorm2d-91          [-1, 256, 28, 28]             512
             ReLU-92          [-1, 256, 28, 28]               0
           Conv2d-93          [-1, 256, 28, 28]         589,824
      BatchNorm2d-94          [-1, 256, 28, 28]             512
           Conv2d-95          [-1, 256, 28, 28]         131,072
           Conv2d-96          [-1, 256, 28, 28]         131,072
      BatchNorm2d-97          [-1, 256, 28, 28]             512
      BatchNorm2d-98          [-1, 256, 28, 28]             512
             ReLU-99          [-1, 256, 28, 28]               0
      BasicBlock-100          [-1, 256, 28, 28]               0
 ConvTranspose2d-101          [-1, 128, 56, 56]         131,200
     BatchNorm2d-102          [-1, 128, 56, 56]             256
            ReLU-103          [-1, 128, 56, 56]               0
          Conv2d-104          [-1, 128, 56, 56]         294,912
     BatchNorm2d-105          [-1, 128, 56, 56]             256
            ReLU-106          [-1, 128, 56, 56]               0
          Conv2d-107          [-1, 128, 56, 56]         147,456
     BatchNorm2d-108          [-1, 128, 56, 56]             256
          Conv2d-109          [-1, 128, 56, 56]          32,768
          Conv2d-110          [-1, 128, 56, 56]          32,768
     BatchNorm2d-111          [-1, 128, 56, 56]             256
     BatchNorm2d-112          [-1, 128, 56, 56]             256
            ReLU-113          [-1, 128, 56, 56]               0
      BasicBlock-114          [-1, 128, 56, 56]               0
          Conv2d-115           [-1, 64, 56, 56]          73,728
     BatchNorm2d-116           [-1, 64, 56, 56]             128
            ReLU-117           [-1, 64, 56, 56]               0
          Conv2d-118           [-1, 64, 56, 56]          36,864
     BatchNorm2d-119           [-1, 64, 56, 56]             128
          Conv2d-120           [-1, 64, 56, 56]           8,192
          Conv2d-121           [-1, 64, 56, 56]           8,192
     BatchNorm2d-122           [-1, 64, 56, 56]             128
     BatchNorm2d-123           [-1, 64, 56, 56]             128
            ReLU-124           [-1, 64, 56, 56]               0
      BasicBlock-125           [-1, 64, 56, 56]               0
        Masking4-126           [-1, 64, 56, 56]               0
          Conv2d-127          [-1, 128, 28, 28]          73,728
     BatchNorm2d-128          [-1, 128, 28, 28]             256
            ReLU-129          [-1, 128, 28, 28]               0
          Conv2d-130          [-1, 128, 28, 28]         147,456
     BatchNorm2d-131          [-1, 128, 28, 28]             256
          Conv2d-132          [-1, 128, 28, 28]           8,192
     BatchNorm2d-133          [-1, 128, 28, 28]             256
            ReLU-134          [-1, 128, 28, 28]               0
      BasicBlock-135          [-1, 128, 28, 28]               0
          Conv2d-136          [-1, 128, 28, 28]         147,456
     BatchNorm2d-137          [-1, 128, 28, 28]             256
            ReLU-138          [-1, 128, 28, 28]               0
          Conv2d-139          [-1, 128, 28, 28]         147,456
     BatchNorm2d-140          [-1, 128, 28, 28]             256
            ReLU-141          [-1, 128, 28, 28]               0
      BasicBlock-142          [-1, 128, 28, 28]               0
          Conv2d-143          [-1, 128, 28, 28]         147,456
     BatchNorm2d-144          [-1, 128, 28, 28]             256
            ReLU-145          [-1, 128, 28, 28]               0
          Conv2d-146          [-1, 128, 28, 28]         147,456
     BatchNorm2d-147          [-1, 128, 28, 28]             256
            ReLU-148          [-1, 128, 28, 28]               0
      BasicBlock-149          [-1, 128, 28, 28]               0
          Conv2d-150          [-1, 128, 28, 28]         147,456
     BatchNorm2d-151          [-1, 128, 28, 28]             256
            ReLU-152          [-1, 128, 28, 28]               0
          Conv2d-153          [-1, 128, 28, 28]         147,456
     BatchNorm2d-154          [-1, 128, 28, 28]             256
            ReLU-155          [-1, 128, 28, 28]               0
      BasicBlock-156          [-1, 128, 28, 28]               0
          Conv2d-157          [-1, 256, 28, 28]         294,912
     BatchNorm2d-158          [-1, 256, 28, 28]             512
            ReLU-159          [-1, 256, 28, 28]               0
          Conv2d-160          [-1, 256, 28, 28]         589,824
     BatchNorm2d-161          [-1, 256, 28, 28]             512
          Conv2d-162          [-1, 256, 28, 28]          32,768
          Conv2d-163          [-1, 256, 28, 28]          32,768
     BatchNorm2d-164          [-1, 256, 28, 28]             512
     BatchNorm2d-165          [-1, 256, 28, 28]             512
            ReLU-166          [-1, 256, 28, 28]               0
      BasicBlock-167          [-1, 256, 28, 28]               0
       MaxPool2d-168          [-1, 256, 14, 14]               0
          Conv2d-169          [-1, 512, 14, 14]       1,179,648
     BatchNorm2d-170          [-1, 512, 14, 14]           1,024
            ReLU-171          [-1, 512, 14, 14]               0
          Conv2d-172          [-1, 512, 14, 14]       2,359,296
     BatchNorm2d-173          [-1, 512, 14, 14]           1,024
          Conv2d-174          [-1, 512, 14, 14]         131,072
          Conv2d-175          [-1, 512, 14, 14]         131,072
     BatchNorm2d-176          [-1, 512, 14, 14]           1,024
     BatchNorm2d-177          [-1, 512, 14, 14]           1,024
            ReLU-178          [-1, 512, 14, 14]               0
      BasicBlock-179          [-1, 512, 14, 14]               0
       MaxPool2d-180            [-1, 512, 7, 7]               0
          Conv2d-181           [-1, 1024, 7, 7]       4,718,592
     BatchNorm2d-182           [-1, 1024, 7, 7]           2,048
            ReLU-183           [-1, 1024, 7, 7]               0
          Conv2d-184           [-1, 1024, 7, 7]       9,437,184
     BatchNorm2d-185           [-1, 1024, 7, 7]           2,048
          Conv2d-186           [-1, 1024, 7, 7]         524,288
          Conv2d-187           [-1, 1024, 7, 7]         524,288
     BatchNorm2d-188           [-1, 1024, 7, 7]           2,048
     BatchNorm2d-189           [-1, 1024, 7, 7]           2,048
            ReLU-190           [-1, 1024, 7, 7]               0
      BasicBlock-191           [-1, 1024, 7, 7]               0
 ConvTranspose2d-192          [-1, 512, 14, 14]       2,097,664
     BatchNorm2d-193          [-1, 512, 14, 14]           1,024
            ReLU-194          [-1, 512, 14, 14]               0
          Conv2d-195          [-1, 512, 14, 14]       4,718,592
     BatchNorm2d-196          [-1, 512, 14, 14]           1,024
            ReLU-197          [-1, 512, 14, 14]               0
          Conv2d-198          [-1, 512, 14, 14]       2,359,296
     BatchNorm2d-199          [-1, 512, 14, 14]           1,024
          Conv2d-200          [-1, 512, 14, 14]         524,288
          Conv2d-201          [-1, 512, 14, 14]         524,288
     BatchNorm2d-202          [-1, 512, 14, 14]           1,024
     BatchNorm2d-203          [-1, 512, 14, 14]           1,024
            ReLU-204          [-1, 512, 14, 14]               0
      BasicBlock-205          [-1, 512, 14, 14]               0
 ConvTranspose2d-206          [-1, 256, 28, 28]         524,544
     BatchNorm2d-207          [-1, 256, 28, 28]             512
            ReLU-208          [-1, 256, 28, 28]               0
          Conv2d-209          [-1, 256, 28, 28]       1,179,648
     BatchNorm2d-210          [-1, 256, 28, 28]             512
            ReLU-211          [-1, 256, 28, 28]               0
          Conv2d-212          [-1, 256, 28, 28]         589,824
     BatchNorm2d-213          [-1, 256, 28, 28]             512
          Conv2d-214          [-1, 256, 28, 28]         131,072
          Conv2d-215          [-1, 256, 28, 28]         131,072
     BatchNorm2d-216          [-1, 256, 28, 28]             512
     BatchNorm2d-217          [-1, 256, 28, 28]             512
            ReLU-218          [-1, 256, 28, 28]               0
      BasicBlock-219          [-1, 256, 28, 28]               0
          Conv2d-220          [-1, 128, 28, 28]         294,912
     BatchNorm2d-221          [-1, 128, 28, 28]             256
            ReLU-222          [-1, 128, 28, 28]               0
          Conv2d-223          [-1, 128, 28, 28]         147,456
     BatchNorm2d-224          [-1, 128, 28, 28]             256
          Conv2d-225          [-1, 128, 28, 28]          32,768
          Conv2d-226          [-1, 128, 28, 28]          32,768
     BatchNorm2d-227          [-1, 128, 28, 28]             256
     BatchNorm2d-228          [-1, 128, 28, 28]             256
            ReLU-229          [-1, 128, 28, 28]               0
      BasicBlock-230          [-1, 128, 28, 28]               0
        Masking3-231          [-1, 128, 28, 28]               0
          Conv2d-232          [-1, 256, 14, 14]         294,912
     BatchNorm2d-233          [-1, 256, 14, 14]             512
            ReLU-234          [-1, 256, 14, 14]               0
          Conv2d-235          [-1, 256, 14, 14]         589,824
     BatchNorm2d-236          [-1, 256, 14, 14]             512
          Conv2d-237          [-1, 256, 14, 14]          32,768
     BatchNorm2d-238          [-1, 256, 14, 14]             512
            ReLU-239          [-1, 256, 14, 14]               0
      BasicBlock-240          [-1, 256, 14, 14]               0
          Conv2d-241          [-1, 256, 14, 14]         589,824
     BatchNorm2d-242          [-1, 256, 14, 14]             512
            ReLU-243          [-1, 256, 14, 14]               0
          Conv2d-244          [-1, 256, 14, 14]         589,824
     BatchNorm2d-245          [-1, 256, 14, 14]             512
            ReLU-246          [-1, 256, 14, 14]               0
      BasicBlock-247          [-1, 256, 14, 14]               0
          Conv2d-248          [-1, 256, 14, 14]         589,824
     BatchNorm2d-249          [-1, 256, 14, 14]             512
            ReLU-250          [-1, 256, 14, 14]               0
          Conv2d-251          [-1, 256, 14, 14]         589,824
     BatchNorm2d-252          [-1, 256, 14, 14]             512
            ReLU-253          [-1, 256, 14, 14]               0
      BasicBlock-254          [-1, 256, 14, 14]               0
          Conv2d-255          [-1, 256, 14, 14]         589,824
     BatchNorm2d-256          [-1, 256, 14, 14]             512
            ReLU-257          [-1, 256, 14, 14]               0
          Conv2d-258          [-1, 256, 14, 14]         589,824
     BatchNorm2d-259          [-1, 256, 14, 14]             512
            ReLU-260          [-1, 256, 14, 14]               0
      BasicBlock-261          [-1, 256, 14, 14]               0
          Conv2d-262          [-1, 256, 14, 14]         589,824
     BatchNorm2d-263          [-1, 256, 14, 14]             512
            ReLU-264          [-1, 256, 14, 14]               0
          Conv2d-265          [-1, 256, 14, 14]         589,824
     BatchNorm2d-266          [-1, 256, 14, 14]             512
            ReLU-267          [-1, 256, 14, 14]               0
      BasicBlock-268          [-1, 256, 14, 14]               0
          Conv2d-269          [-1, 256, 14, 14]         589,824
     BatchNorm2d-270          [-1, 256, 14, 14]             512
            ReLU-271          [-1, 256, 14, 14]               0
          Conv2d-272          [-1, 256, 14, 14]         589,824
     BatchNorm2d-273          [-1, 256, 14, 14]             512
            ReLU-274          [-1, 256, 14, 14]               0
      BasicBlock-275          [-1, 256, 14, 14]               0
          Conv2d-276          [-1, 512, 14, 14]       1,179,648
     BatchNorm2d-277          [-1, 512, 14, 14]           1,024
            ReLU-278          [-1, 512, 14, 14]               0
          Conv2d-279          [-1, 512, 14, 14]       2,359,296
     BatchNorm2d-280          [-1, 512, 14, 14]           1,024
          Conv2d-281          [-1, 512, 14, 14]         131,072
          Conv2d-282          [-1, 512, 14, 14]         131,072
     BatchNorm2d-283          [-1, 512, 14, 14]           1,024
     BatchNorm2d-284          [-1, 512, 14, 14]           1,024
            ReLU-285          [-1, 512, 14, 14]               0
      BasicBlock-286          [-1, 512, 14, 14]               0
       MaxPool2d-287            [-1, 512, 7, 7]               0
          Conv2d-288           [-1, 1024, 7, 7]       4,718,592
     BatchNorm2d-289           [-1, 1024, 7, 7]           2,048
            ReLU-290           [-1, 1024, 7, 7]               0
          Conv2d-291           [-1, 1024, 7, 7]       9,437,184
     BatchNorm2d-292           [-1, 1024, 7, 7]           2,048
          Conv2d-293           [-1, 1024, 7, 7]         524,288
          Conv2d-294           [-1, 1024, 7, 7]         524,288
     BatchNorm2d-295           [-1, 1024, 7, 7]           2,048
     BatchNorm2d-296           [-1, 1024, 7, 7]           2,048
            ReLU-297           [-1, 1024, 7, 7]               0
      BasicBlock-298           [-1, 1024, 7, 7]               0
 ConvTranspose2d-299          [-1, 512, 14, 14]       2,097,664
     BatchNorm2d-300          [-1, 512, 14, 14]           1,024
            ReLU-301          [-1, 512, 14, 14]               0
          Conv2d-302          [-1, 512, 14, 14]       4,718,592
     BatchNorm2d-303          [-1, 512, 14, 14]           1,024
            ReLU-304          [-1, 512, 14, 14]               0
          Conv2d-305          [-1, 512, 14, 14]       2,359,296
     BatchNorm2d-306          [-1, 512, 14, 14]           1,024
          Conv2d-307          [-1, 512, 14, 14]         524,288
          Conv2d-308          [-1, 512, 14, 14]         524,288
     BatchNorm2d-309          [-1, 512, 14, 14]           1,024
     BatchNorm2d-310          [-1, 512, 14, 14]           1,024
            ReLU-311          [-1, 512, 14, 14]               0
      BasicBlock-312          [-1, 512, 14, 14]               0
          Conv2d-313          [-1, 256, 14, 14]       1,179,648
     BatchNorm2d-314          [-1, 256, 14, 14]             512
            ReLU-315          [-1, 256, 14, 14]               0
          Conv2d-316          [-1, 256, 14, 14]         589,824
     BatchNorm2d-317          [-1, 256, 14, 14]             512
          Conv2d-318          [-1, 256, 14, 14]         131,072
          Conv2d-319          [-1, 256, 14, 14]         131,072
     BatchNorm2d-320          [-1, 256, 14, 14]             512
     BatchNorm2d-321          [-1, 256, 14, 14]             512
            ReLU-322          [-1, 256, 14, 14]               0
      BasicBlock-323          [-1, 256, 14, 14]               0
        Masking2-324          [-1, 256, 14, 14]               0
          Conv2d-325            [-1, 512, 7, 7]       1,179,648
     BatchNorm2d-326            [-1, 512, 7, 7]           1,024
            ReLU-327            [-1, 512, 7, 7]               0
          Conv2d-328            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-329            [-1, 512, 7, 7]           1,024
          Conv2d-330            [-1, 512, 7, 7]         131,072
     BatchNorm2d-331            [-1, 512, 7, 7]           1,024
            ReLU-332            [-1, 512, 7, 7]               0
      BasicBlock-333            [-1, 512, 7, 7]               0
          Conv2d-334            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-335            [-1, 512, 7, 7]           1,024
            ReLU-336            [-1, 512, 7, 7]               0
          Conv2d-337            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-338            [-1, 512, 7, 7]           1,024
            ReLU-339            [-1, 512, 7, 7]               0
      BasicBlock-340            [-1, 512, 7, 7]               0
          Conv2d-341            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-342            [-1, 512, 7, 7]           1,024
            ReLU-343            [-1, 512, 7, 7]               0
          Conv2d-344            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-345            [-1, 512, 7, 7]           1,024
            ReLU-346            [-1, 512, 7, 7]               0
      BasicBlock-347            [-1, 512, 7, 7]               0
          Conv2d-348           [-1, 1024, 7, 7]       4,718,592
     BatchNorm2d-349           [-1, 1024, 7, 7]           2,048
            ReLU-350           [-1, 1024, 7, 7]               0
          Conv2d-351           [-1, 1024, 7, 7]       9,437,184
     BatchNorm2d-352           [-1, 1024, 7, 7]           2,048
          Conv2d-353           [-1, 1024, 7, 7]         524,288
          Conv2d-354           [-1, 1024, 7, 7]         524,288
     BatchNorm2d-355           [-1, 1024, 7, 7]           2,048
     BatchNorm2d-356           [-1, 1024, 7, 7]           2,048
            ReLU-357           [-1, 1024, 7, 7]               0
      BasicBlock-358           [-1, 1024, 7, 7]               0
          Conv2d-359            [-1, 512, 7, 7]       4,718,592
     BatchNorm2d-360            [-1, 512, 7, 7]           1,024
            ReLU-361            [-1, 512, 7, 7]               0
          Conv2d-362            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-363            [-1, 512, 7, 7]           1,024
          Conv2d-364            [-1, 512, 7, 7]         524,288
          Conv2d-365            [-1, 512, 7, 7]         524,288
     BatchNorm2d-366            [-1, 512, 7, 7]           1,024
     BatchNorm2d-367            [-1, 512, 7, 7]           1,024
            ReLU-368            [-1, 512, 7, 7]               0
      BasicBlock-369            [-1, 512, 7, 7]               0
        Masking1-370            [-1, 512, 7, 7]               0
AdaptiveAvgPool2d-371            [-1, 512, 1, 1]               0
         Dropout-372                  [-1, 512]               0
          Linear-373                    [-1, 7]           3,591
================================================================
Total params: 142,943,431
Trainable params: 142,943,431
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 360.23
Params size (MB): 545.29
Estimated Total Size (MB): 906.09
----------------------------------------------------------------